# Position Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
InCanvasControlData..::..Position Property
InCanvasControlData Class See Also
---
The position of the in-canvas control in model coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public XYZ Position { get; set; }
```

Visual Basic
---
```text
Public Property Position As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Position {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
InCanvasControlData Class
Autodesk.Revit.DB Namespace